# --- ЗАВДАННЯ 2: Тільки парні (Цикл FOR + range) ---
# Завдання: Виведи всі ПАРНІ числа від 0 до 20.
# Підказка: Функція range() може мати третій параметр - крок. range(start, stop, step)


# --- ЗАВДАННЯ 3: Вгадай слово (Цикл WHILE) ---
# Завдання: Програма має запитувати у користувача пароль, поки він не введе "python".
# Якщо пароль правильний - написати "Доступ дозволено!" і завершити роботу.

secret = "python"
guess = ""

# print("Введіть пароль:")
# Напиши свій цикл while тут:
# ...

while guess != secret:
    guess = input("Haберіть пароль: ")


# Напиши свій цикл тут:
for i in range(-1, 21, 2):
    # if i % 2 == 0:
    print(f"Парні числа:  {i}")


total = 0

for i in range(1, 101):
    total += i

print(f"Сума чисел від 1 до 100: {total}")
